# read design
read -sv src/bcd_controlador_3digitos.v
hierarchy -top bcd_controlador_3digitos

# the high-level stuff
proc; opt

# opens a window with the RTL diagram
show -format ps -viewer gv

# generate verilog optimized code
#write_verilog sim/src/controle_maquina.v

# cleanup
clean
